# indian ai production pandas part-3 

# How to create python pandas dataframe

In [2]:
import pandas as pd

In [4]:
emt_df=pd.DataFrame()
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [5]:
lst=['a','b','c']
print(lst)

['a', 'b', 'c']

In [8]:
df1=pd.DataFrame(lst)
print(df1)

   0
0  a
1  b
2  c

In [9]:
df1

   0
0  a
1  b
2  c

In [10]:
ls_of_ls=[[1,2,3],[2,3,4],[4,5,6]]
print(ls_of_ls)

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [11]:
df2=pd.DataFrame(ls_of_ls)
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [15]:
dic_1={"Id":[11,22,33,44]}
dic_1

{'Id': [11, 22, 33, 44]}

In [16]:
df3=pd.DataFrame(dic_1)
df3

   Id
0  11
1  22
2  33
3  44

In [19]:
dic_2={"Id":[11,22,33,44],"Ln":["en","bn","fn","ch"]}
dic_2

{'Id': [11, 22, 33, 44], 'Ln': ['en', 'bn', 'fn', 'ch']}

In [20]:
df4=pd.DataFrame(dic_2)
df4

   Id  Ln
0  11  en
1  22  bn
2  33  fn
3  44  ch

In [24]:
ls_dic=[{'a':1,'b':2},{'a':3,'b':4}]
ls_dic

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]

In [25]:
df5=pd.DataFrame(ls_dic)
df5

   a  b
0  1  2
1  3  4

In [28]:
ls_dic1=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]
ls_dic1

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4, 'c': 5}]

In [29]:
df6=pd.DataFrame(ls_dic1)
df6

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [33]:
dic_sr={"ID":pd.Series([1,2,3]),'SN':[111,222,333]}
df7=pd.DataFrame(dic_sr)
df7

   ID   SN
0   1  111
1   2  222
2   3  333